#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan for staging</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.database.random_password.db_password: Refreshing state... [id=none]
aws_iam_user.s3_user: Refreshing state... [id=receiptly-staging-s3-user]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-0e9e18930ef88c110]
module.receipts_bucket.aws_s3_bucket.this: Refreshing state... [id=receiptly-staging-receipts]
aws_iam_access_key.s3_user: Refreshing state... [id=AKIA5ZJTSBRRPYO6ZRE3]
module.receipts_bucket.aws_s3_bucket_public_access_block.this: Refreshing state... [id=receiptly-staging-receipts]
aws_iam_user_policy.s3_access: Refreshing state... [id=receiptly-staging-s3-user:receiptly-staging-s3-access]
module.receipts_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=receiptly-staging-receipts]
module.receipts_bucket.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=receiptly-staging-receipts]
module.receipts_bucket.aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=receiptly-staging-receipts]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.receipts_bucket.aws_s3_bucket.this has been deleted
  - resource "aws_s3_bucket" "this" {
      - arn                         = "arn:aws:s3:::receiptly-staging-receipts" -> null
      - bucket_domain_name          = "receiptly-staging-receipts.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "receiptly-staging-receipts.s3.ap-southeast-1.amazonaws.com" -> null
      - id                          = "receiptly-staging-receipts" -> null
        tags                        = {
            "Environment" = "staging"
            "Project"     = "receiptly"
            "Purpose"     = "Receipt Image Storage"
        }
        # (7 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_user_policy.s3_access will be updated in-place
  ~ resource "aws_iam_user_policy" "s3_access" {
        id     = "receiptly-staging-s3-user:receiptly-staging-s3-access"
        name   = "receiptly-staging-s3-access"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                          - "s3:ListBucket",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::receiptly-staging-receipts",
                          - "arn:aws:s3:::receiptly-staging-receipts/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.receipts_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "receiptly-staging-receipts"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "staging"
          + "Project"     = "receiptly"
          + "Purpose"     = "Receipt Image Storage"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "receiptly"
          + "Purpose"     = "Receipt Image Storage"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.receipts_bucket.aws_s3_bucket_public_access_block.this must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
      ~ bucket                  = "receiptly-staging-receipts" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "receiptly-staging-receipts" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.receipts_bucket.aws_s3_bucket_versioning.this must be replaced
-/+ resource "aws_s3_bucket_versioning" "this" {
      ~ bucket = "receiptly-staging-receipts" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "receiptly-staging-receipts" -> (known after apply)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ receipts_bucket_arn         = "arn:aws:s3:::receiptly-staging-receipts" -> (known after apply)
  ~ receipts_bucket_name        = "receiptly-staging-receipts" -> (known after apply)

```

</details>

*Pushed by: @eddykuhan, Action: `pull_request`*